In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

有许多用于重新排列表格型数据的基础运算，这些函数也称作重塑（reshape）或透视（轴向旋转，pivot）运算
层次化索引为DataFrame数据的重新排列任务提供了一种具有良好一致性的方式。主要功能有二：
    stack：将数据的列透视（旋转）为行。
    unstack：将数据的行透视（旋转）为列。

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [3]:
result = data.stack()  # “堆叠”操作
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [4]:
result.unstack()  # 默认情况下“拆堆”的是最内层索引

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [5]:
result.unstack(0)  # 指定“拆堆”索引的id

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [6]:
result.unstack('state')  # 指定“拆堆”索引的名称

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [7]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [8]:
data2.unstack()  # “拆堆”可能会产生缺失值

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [9]:
data2.unstack().stack()  # “堆叠”默认是过滤缺失值的，“堆叠”与“拆堆”是可逆的

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [10]:
data2.unstack().stack(dropna=False)  # “堆叠”操作保留缺失值

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [11]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
result = data.stack()
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [12]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [13]:
df.unstack('state').stack()  # “堆叠”操作默认“堆叠”最内层

side             left  right
number state
one    Ohio         0      5
       Colorado     3      8
two    Ohio         1      6
       Colorado     4      9
three  Ohio         2      7
       Colorado     5     10

In [14]:
df.unstack('state').stack(0)  # “堆叠”操作指明需要“堆叠”轴的id

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [15]:
df.unstack('state').stack('side')  # “堆叠”操作指明需要“堆叠”轴的名称

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7